;; -*- no-byte-compile: t; -*-
;;; ~/.doom.d/packages.el

(package! rvm)
;; (package! helm-dash)
(package! avy)
(package! coffee-mode)
(package! auto-dictionary)
(package! yasnippet-snippets)
(package! multiple-cursors)
(package! git-link)
(package! ggtags)
(package! flx)
(package! tss)
(package! tide)
(package! typescript-mode)
(package! deadgrep)
;; DAP mode
;; (package! dap-mode)
;; (package! lsp-mode)
;; (package! lsp-ui)
;; (package! company-lsp)
;; (package! evil-string-inflection)
;; (package! evil-collection)
;; (package! evil-magit)
(package! feature-mode)
(package! ember-mode)
(package! easy-kill)
(package! pretty-mode)
(package! try)
(package! org-jira)
(package! rinari)
(package! web-beautify)
(package! json-mode)
;; (package! lsp-treemacs)
;; (package! highlight-symbol
;; :pin "7a789c779648c55b16e43278e51be5898c121b3a")

;; Completion
;; (package! company)
;; (package! company-lsp)

;; TODO Pin this package
;; (package! flymake-ruby)

;; TODO Pin this package
;; (package! company-web)

(package! impatient-mode)
